Pandas-DataFrame and Series

Pandas is powerfull data manipulation library in python, widely used for data analysis and data cleaning. It Provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially hetrogeneous tabular data structure with labled axes(rows and columns).

In [1]:
import pandas as pd

In [2]:
## Series
## Pandas is one dimensional data structure array like object that can hold data of any type. It is similar to a column in the table.

data = [1,2,3,4,5]
df = pd.Series(data)
print(df)
print(type(df))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
## Creating a series from a dictionary
data = {'a': 1, 'b': 2, 'c': 3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
data =[1,2,3,4,5]
index = ['a','b','c','d','e']
df = pd.Series(data,index)
print(df)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
#DataFrame
#create a dataframe from a dictionary of list

data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29,42],
        'city':['London', 'Manchester', 'Liverpool', 'Bristol']}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age        city
0    Tom   28      London
1   Jack   34  Manchester
2  Steve   29   Liverpool
3  Ricky   42     Bristol
<class 'pandas.core.frame.DataFrame'>

In [6]:
##create a dataframe from a list of dictionaries

data = [
    {'Name': 'Tom', 'Age': 28, 'city': 'London'},
    {'Name': 'Jack', 'Age': 34, 'city': 'Manchester'},
    {'Name': 'Steve', 'Age': 29, 'city': 'Liverpool'},
    {'Name': 'Ricky', 'Age': 42, 'city': 'Bristol'}
]

df_dict = pd.DataFrame(data)
print(df_dict)
print(type(df_dict))

    Name  Age        city
0    Tom   28      London
1   Jack   34  Manchester
2  Steve   29   Liverpool
3  Ricky   42     Bristol
<class 'pandas.core.frame.DataFrame'>

In [7]:
#read csv file

df = pd.read_csv('sales_data.csv')

df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [8]:
##Accessing data from a dataframe

df_dict

    Name  Age        city
0    Tom   28      London
1   Jack   34  Manchester
2  Steve   29   Liverpool
3  Ricky   42     Bristol

In [9]:
df_dict['Name']

0      Tom
1     Jack
2    Steve
3    Ricky
Name: Name, dtype: object

In [10]:
type(df_dict['Name'])

pandas.core.series.Series

In [11]:
df_dict.loc[0] #return a 0th row

Name       Tom
Age         28
city    London
Name: 0, dtype: object

In [12]:
df_dict.loc[0][0] #return a 0th row and 0th column

C:\Users\ranje\AppData\Local\Temp\ipykernel_22556\22923888.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df_dict.loc[0][0] #return a 0th row and 0th column

'Tom'

In [13]:
df_dict

    Name  Age        city
0    Tom   28      London
1   Jack   34  Manchester
2  Steve   29   Liverpool
3  Ricky   42     Bristol

In [14]:
df_dict.iloc[0]#return a 0th column

Name       Tom
Age         28
city    London
Name: 0, dtype: object

In [15]:
## Accesing a specified element                                                                           
df_dict.at[1,'Age']

np.int64(34)

In [16]:
## Accesing a specified element using iat

df_dict.iat[0,1]

np.int64(28)

In [17]:
df_dict.iat[1,2]

'Manchester'

In [18]:
df_dict

    Name  Age        city
0    Tom   28      London
1   Jack   34  Manchester
2  Steve   29   Liverpool
3  Ricky   42     Bristol

In [19]:
## Data Manipulation with DataFrame
#Adding a column to the dataframe
df_dict['Salary']=[1000,2000,3000,4000]
df_dict

    Name  Age        city  Salary
0    Tom   28      London    1000
1   Jack   34  Manchester    2000
2  Steve   29   Liverpool    3000
3  Ricky   42     Bristol    4000

In [20]:
#Removing a column from the dataframe
df_dict = df_dict.drop('Salary',axis=1)#,inplace=True) 
#axis = 1 means column axis = 0 means row and inplace = True means it will change the original dataframe without creating a variable
df_dict

    Name  Age        city
0    Tom   28      London
1   Jack   34  Manchester
2  Steve   29   Liverpool
3  Ricky   42     Bristol

In [21]:
## Add age to the column

df_dict['Age']= df_dict['Age']+1

df_dict

    Name  Age        city
0    Tom   29      London
1   Jack   35  Manchester
2  Steve   30   Liverpool
3  Ricky   43     Bristol

In [25]:
df_dict = df_dict.drop(df_dict[df_dict['Age'] > 40].index)

In [26]:
df_dict

    Name  Age        city
0    Tom   29      London
1   Jack   35  Manchester
2  Steve   30   Liverpool

In [28]:
#display the data types of the dataframe

print("Data types:\n",df.dtypes)

#display the summary statistics of the dataframe

print("Summary statistics:\n",df.describe())

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000